#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-xrHiGqxzVp8q9UnE

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
random_password.db_password: Refreshing state... [id=none]
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_dynamodb_table.state_locking: Refreshing state... [id=xgr00q-dev-state-locking]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:220881534007:certificate/399165e3-6c0b-4264-940c-3a960e4b86b0]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_iam_role.api_gateway_s3_role: Refreshing state... [id=ApiGatewayAmazonS3AccessRole]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_cloudwatch_event_rule.siteminder-tests-scheduler: Refreshing state... [id=siteminder-tests-scheduler]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=etb5fq]
aws_api_gateway_resource.app: Refreshing state... [id=guevy4]
aws_api_gateway_resource.api: Refreshing state... [id=9jt82m]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cmapde]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=qorb7e]
aws_api_gateway_resource.app_proxy: Refreshing state... [id=bog9v3]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=ogj40z]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=uysksd]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_method.app_proxy: Refreshing state... [id=agm-gcp9dahm4c-bog9v3-ANY]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-gcp9dahm4c-qorb7e-GET]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api-dev.loginproxy.gov.bc.ca]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-gcp9dahm4c-ogj40z-GET]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-gcp9dahm4c-uysksd-ANY]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-gcp9dahm4c-qorb7e-GET-200]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-gcp9dahm4c-ogj40z-GET-200]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-api-swagger,private]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-api-swagger]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
aws_iam_role_policy.s3_read_access_policy: Refreshing state... [id=ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy]
aws_api_gateway_integration.openapi_swagger: Refreshing state... [id=agi-gcp9dahm4c-qorb7e-GET]
aws_api_gateway_integration.openapi_swagger_assets: Refreshing state... [id=agi-gcp9dahm4c-ogj40z-GET]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=zfeccr]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_api_gateway_integration_response.openapi_swagger: Refreshing state... [id=agir-gcp9dahm4c-qorb7e-GET-200]
aws_api_gateway_integration_response.openapi_swagger_assets: Refreshing state... [id=agir-gcp9dahm4c-ogj40z-GET-200]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
aws_lambda_function.siteminder-tests-scheduler: Refreshing state... [id=lambda-siteminder-tests-scheduler]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_cloudwatch_event_target.siteminder-tests-scheduler: Refreshing state... [id=siteminder-tests-scheduler-siteminder-tests-scheduler]
aws_lambda_permission.siteminder-tests-scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_api_gateway_integration.api: Refreshing state... [id=agi-gcp9dahm4c-uysksd-ANY]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_integration.app: Refreshing state... [id=agi-gcp9dahm4c-bog9v3-ANY]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_deployment.this: Refreshing state... [id=i2174j]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-10-24T20:53:32.815Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-10-24T20:53:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "VuyakquNCIhxnJKl3MRd7MMHrc5tjDFYtzA56x963qg=" -> "lgGo+q88Ud9DHJWVT/aiDaagdmWfRym/inQsKOBezeQ="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-10-24T20:53:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "yjIs1G1j9NB0byKpV+/VImbMUz1S/WeuPJphvqQyh7M=" -> "FQamW1U6PIi7kKJ8CDyb+Tv2ELK2NHFJ0amZZmtE3Zk="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-10-24T20:53:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "XV7EMJKvCkviJLK9+TLwH7p92g3B9tXli2pmxoaqRJk=" -> "/0UNjdgShWxygaZ9K8t5gIgjaww7u/6ib75F1R4rDik="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-10-24T20:53:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "YvPfBJOW3SgtzAwmzUI5IkADA36JVxMAWnRNSdSXcCk=" -> "+wYYkUgKqeX3bd4OgAuM+FEBdQ/kdcxdeAxtrlQog10="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-10-24T20:53:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "zL9NeQCRicRTbcbBMkf9pyw0QnVT+vYHmH7y7gdnKkc=" -> "cQuwzsgc+5E6INHfmmESvl2lhFmxgdu7qeEuqFUer/o="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.siteminder-tests-scheduler will be updated in-place
  ~ resource "aws_lambda_function" "siteminder-tests-scheduler" {
        id                             = "lambda-siteminder-tests-scheduler"
      ~ last_modified                  = "2022-10-24T20:53:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "wj2UrWIa4TgtyIvYq4eVaOq8WtMqAPiQuyoJw5LZ+jM=" -> "VQzDGYGLinlWUU38QeSi5pfXAsiZ5ae+o9GSPac0h94="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_s3_object.swagger_dist["swagger-output.json"] will be updated in-place
  ~ resource "aws_s3_object" "swagger_dist" {
      ~ etag               = "929573423fca43da9b37dd7a33e3a03d" -> "754e292cecae4720202eef8520b3d38b"
        id                 = "swagger-output.json"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-10-24T20:53:32.815Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 34 estimated
           $178.56/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*